learning-from-data.org
#+SETUPFILE: setup/theme-readtheorg.setup
#+EXPORT_FILE_NAME: dist/learning-from-data.html
#+OPTIONS: toc:3
#+TITLE: Learning from data course notes

* 1 - The Learning Problem
** The essence of machine learning
- A pattern exists.
- We cannot pin it down mathematically. (If we could, then why learn from data? :D)
- We have enough data.
** Simple Example
We have a bunch of movies and many customers. We have some ratings
given by these users for a subset of the movies.

Can we recommend movies for a user? How?

We can represent each user by a set of genres (/features/. Say comedy,
action, romance etc). Ask the user how much he likes each of the
genres. Similarly, represent movies by a bunch of genres and match
each movie to each user.

This works, but is not really learning. We have to go and ask each
user how much he likes each genre. But if we have data (ratings given
by a user for a movie), we can try learning these features using the
data. This is 'learning from data'.
** Components of learning (Lets take Supervised learning)
Ex) A bank wants to know if it should approve credit for a customer.

- Input x (Customer application)
- Output y (good customer/ bad customer)
- Target function f: X -> Y (ideal credit approval formula)

In all learning problems, we do not know this target function
(Remember, if we knew this, there is no need to learn from data)

- Data: (x_{1}, y_1), (x_2, y_2) ... (x_N, y_N) (Data from past customers)
- Hypothesis: g: X -> Y (an approximation of f, that we learn)

(Check out the slides for the learning diagram)


1) Target Function, f: \Chi \rarr \Upsilon
2) Training Examples, (x_1, y_1), ... , (x_N, y_N)
3) Learning Algorithm, \Alpha
4) Error Measure E(h, f)
5) Hypothesis Set, \Eta
6) Learned hypothesis, g \approx f

The hypothesis set can be infinite (Learn from the set of all possible
functions) or finite (like linear functions, quadratic functions etc).
*** What do we get to select in this learning process
Well, we can change the learning algorithm and hypothesis set.
Together, they define a /learning model/.
** Simple Learning Model example, Peceptron
- Can be used when data is linearly seperable and the output y is binary.
- Given a data set (x_1, y_1), ... (x_N, y_N).

Predict Sign(\Sigma^N_{i=0}(w_{i}.x_{i})) where x_0 = 1.

How to find the weights w_{1}...w_{d}?
*** Algorithm (Perceptron Learning Algorith, PLA)
1) Initialize all weights to random numbers.
2) Pick one of the points from (x_i, y_i) that has been misclassified. i.e Sign(w^{T}.x_n) \ne y_n
3) Update w_(t+1) = w_t + y_{i}.x_i
Intuitively this makes sense, we 'nudge' the weights in a direction
such that y_i is classified correctly.
4) Do this till all points are classified correctly.

Other are other variations to this basic algorithm that will work with
real-values outputs and non-linear data.
** Basic Premise of learning
/Use a bunch of observations to uncover an underlying process/

Broad Permise \Rightarrow Many variations

- Supervised learning
Given a bunch of (input, correct output)... Find a hypothesis that
works with new data.
- Unsupervised learning
Given a bunch of (input, ?), can we uncover some pattern? Create some
kind of clusters of similar data.
- Reinforcement learning
Given (input, ?, grade for an output), can we improve our algorithm
step by step.  Ex) Game playing, grade every move the algorithm makes,
give penalty for bad moves and +ve score for good moves. Overtime, the
algorithm gets better.
