dist/learning-from-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-30 Sun 13:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning from data course notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Siddharth S" />
<link rel="stylesheet" type="text/css" href="https://subsid.github.io/notes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://subsid.github.io/notes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Learning from data course notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcae3e68">1. 1 - The Learning Problem</a>
<ul>
<li><a href="#org13ece2f">1.1. The essence of machine learning</a></li>
<li><a href="#org037dfc0">1.2. Simple Example</a></li>
<li><a href="#orgcc20f12">1.3. Components of learning (Lets take Supervised learning)</a>
<ul>
<li><a href="#org3a6c1ef">1.3.1. What do we get to select in this learning process</a></li>
</ul>
</li>
<li><a href="#org10319b9">1.4. Simple Learning Model example, Peceptron</a>
<ul>
<li><a href="#orgf93a16b">1.4.1. Algorithm (Perceptron Learning Algorith, PLA)</a></li>
</ul>
</li>
<li><a href="#orge6867f6">1.5. Basic Premise of learning</a></li>
</ul>
</li>
<li><a href="#org6685410">2. 2 - Is Learning Feasible</a>
<ul>
<li><a href="#org431dd73">2.1. Related Experiment</a>
<ul>
<li><a href="#orgb351fc5">2.1.1. How close is &nu; to &mu;?</a></li>
</ul>
</li>
<li><a href="#orgfa862b3">2.2. How does this relate to learning?</a>
<ul>
<li><a href="#orgbf3bc3e">2.2.1. So what does this mean?</a></li>
<li><a href="#org72c6db5">2.2.2. Aside: Update the learning diagram to account for probability</a></li>
<li><a href="#org981308f">2.2.3. Notation change for Learning</a></li>
<li><a href="#org6c2e6a0">2.2.4. Account for multiple hypothesis</a></li>
<li><a href="#orgfb82714">2.2.5. Simple solution and summary</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9c41bf2">3. 3 - Linear Model 1</a>
<ul>
<li><a href="#org3db77b9">3.1. Questions</a></li>
<li><a href="#orga86e355">3.2. Real data set</a>
<ul>
<li><a href="#org7252c08">3.2.1. Input Representation</a></li>
</ul>
</li>
<li><a href="#org274718e">3.3. Linear Classification - Perceptron Learning Algorithm</a>
<ul>
<li><a href="#org0f5a26f">3.3.1. The 'pocket' Algorithm</a></li>
</ul>
</li>
<li><a href="#orga5ae607">3.4. Linear Regression</a>
<ul>
<li><a href="#orgf78ef63">3.4.1. What is linear regression trying to find</a></li>
<li><a href="#org36c8a46">3.4.2. How to measure error</a></li>
<li><a href="#orgab1e076">3.4.3. Expression for E<sub>in</sub></a></li>
<li><a href="#orgfc6b931">3.4.4. Minimizing E<sub>in</sub></a></li>
<li><a href="#orgc7b78fa">3.4.5. The linear regression algorithm</a></li>
<li><a href="#org595bc4c">3.4.6. Linear regression for classification</a></li>
</ul>
</li>
<li><a href="#org9a6a90f">3.5. Nonlinear transformation</a>
<ul>
<li><a href="#org8996f4d">3.5.1. Linear in what?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6925251">4. 4 - Error and Noise</a>
<ul>
<li><a href="#org65bf417">4.1. Non-Linear transormation continued</a>
<ul>
<li><a href="#org24a5af7">4.1.1. Why does it work?</a></li>
<li><a href="#orgf12c76d">4.1.2. What transforms to what</a></li>
</ul>
</li>
<li><a href="#org3ecdac5">4.2. Error Measures</a></li>
<li><a href="#org34c2d0f">4.3. How to choose an error measure</a></li>
<li><a href="#org9ae7575">4.4. Noisy targets</a></li>
<li><a href="#org72cd61c">4.5. Components of Learning (including noisy targets)</a></li>
<li><a href="#org7b5f7b9">4.6. Distinction between P(y|x) and P(x)</a></li>
<li><a href="#orga79b502">4.7. Preamble to the theory</a>
<ul>
<li><a href="#org56b6044">4.7.1. What do we know so far?</a></li>
<li><a href="#org537a824">4.7.2. Full story of learning has 2 questions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org79cb895">5. 5 - Training vs Testing</a>
<ul>
<li><a href="#orgda1fda0">5.1. What is the difference between training and testing?</a></li>
<li><a href="#orga8cbb71">5.2. Where did M come from?</a></li>
<li><a href="#org9f12b1c">5.3. Can we improve M?</a>
<ul>
<li><a href="#org497b4d8">5.3.1. Why do we care about this?</a></li>
<li><a href="#orgaef3632">5.3.2. Dichotomies (mini-hypothesis)</a></li>
<li><a href="#org951c59c">5.3.3. Growth Funciton</a></li>
<li><a href="#orgef7e269">5.3.4. key terms: Shattering and Breakpoint</a></li>
<li><a href="#orgddfea2c">5.3.5. What can we do with this stuff?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcccd5a7">6. 6 - Theory of generalization</a>
<ul>
<li><a href="#org430effa">6.1. 2 things to prove</a></li>
<li><a href="#org376f65d">6.2. Bounding \(m_H(N)\)</a>
<ul>
<li><a href="#org7d65c3d">6.2.1. Key quantity</a></li>
<li><a href="#orga1b703c">6.2.2. Recursive bound</a></li>
<li><a href="#org5d25a35">6.2.3. B(N, k) is a polynomial!</a></li>
<li><a href="#org9705cf8">6.2.4. How can m<sub>H</sub>(N) replace M</a></li>
<li><a href="#org3db4400">6.2.5. The Vapnik-Chervonenkis Inequality</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5ddac84">7. 7 - The VC-Dimension</a>
<ul>
<li><a href="#org0de3ccc">7.1. What is this?</a></li>
<li><a href="#orgab33219">7.2. VC-dimension and learning</a></li>
<li><a href="#org4abfd6a">7.3. VC-dimension of the perceptron</a></li>
<li><a href="#orgaaace58">7.4. Interpretting the vc dimension (using the perceptron example)</a>
<ul>
<li><a href="#orgd9df5c5">7.4.1. Degrees of freedom</a></li>
<li><a href="#orge64c909">7.4.2. Number of data points needed</a></li>
</ul>
</li>
<li><a href="#org26dca03">7.5. Rearranging things</a></li>
</ul>
</li>
<li><a href="#org6c17af3">8. 8 - Bias-Variance Tradeoff</a>
<ul>
<li><a href="#org2974daa">8.1. Approximation-generalization tradeoff</a></li>
<li><a href="#org7e1b25c">8.2. Quantifying this trade-off</a></li>
<li><a href="#org41ad5ee">8.3. Start with E<sub>out</sub></a></li>
<li><a href="#orgb574553">8.4. Bias and Variance</a></li>
<li><a href="#org44cac8d">8.5. Lesson learned</a></li>
<li><a href="#org70847c5">8.6. Learning curves (expected E<sub>out</sub> and E<sub>in</sub>)</a></li>
</ul>
</li>
<li><a href="#org0adde94">9. 9 - Linear Model 2</a></li>
<li><a href="#org672305a">10. 10 - Neural Networks</a>
<ul>
<li><a href="#org03dd3ca">10.1. Questions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcae3e68" class="outline-2">
<h2 id="orgcae3e68"><span class="section-number-2">1</span> 1 - The Learning Problem</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org13ece2f" class="outline-3">
<h3 id="org13ece2f"><span class="section-number-3">1.1</span> The essence of machine learning</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>A pattern exists.</li>
<li>We cannot pin it down mathematically. (If we could, then why learn from data? :D)</li>
<li>We have enough data.</li>
</ul>
</div>
</div>
<div id="outline-container-org037dfc0" class="outline-3">
<h3 id="org037dfc0"><span class="section-number-3">1.2</span> Simple Example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We have a bunch of movies and many customers. We have some ratings
given by these users for a subset of the movies.
</p>

<p>
Can we recommend movies for a user? How?
</p>

<p>
We can represent each user by a set of genres (<i>features</i>. Say comedy,
action, romance etc). Ask the user how much he likes each of the
genres. Similarly, represent movies by a bunch of genres and match
each movie to each user.
</p>

<p>
This works, but is not really learning. We have to go and ask each
user how much he likes each genre. But if we have data (ratings given
by a user for a movie), we can try learning these features using the
data. This is 'learning from data'.
</p>
</div>
</div>
<div id="outline-container-orgcc20f12" class="outline-3">
<h3 id="orgcc20f12"><span class="section-number-3">1.3</span> Components of learning (Lets take Supervised learning)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Ex) A bank wants to know if it should approve credit for a customer.
</p>

<ul class="org-ul">
<li>Input x (Customer application)</li>
<li>Output y (good customer/ bad customer)</li>
<li>Target function f: X -&gt; Y (ideal credit approval formula)</li>
</ul>

<p>
In all learning problems, we do not know this target function
(Remember, if we knew this, there is no need to learn from data)
</p>

<ul class="org-ul">
<li>Data: (x<sub>1</sub>, y<sub>1</sub>), (x<sub>2</sub>, y<sub>2</sub>) &#x2026; (x<sub>N</sub>, y<sub>N</sub>) (Data from past customers)</li>
<li>Hypothesis: g: X -&gt; Y (an approximation of f, that we learn)</li>
</ul>

<p>
(Check out the slides for the learning diagram)
</p>


<ol class="org-ol">
<li>Target Function, f: &Chi; &rarr; &Upsilon;</li>
<li>Training Examples, (x<sub>1</sub>, y<sub>1</sub>), &#x2026; , (x<sub>N</sub>, y<sub>N</sub>)</li>
<li>Learning Algorithm, &Alpha;</li>
<li>Error Measure E(h, f)</li>
<li>Hypothesis Set, &Eta;</li>
<li>Learned hypothesis, g &asymp; f</li>
</ol>

<p>
The hypothesis set can be infinite (Learn from the set of all possible
functions) or finite (like linear functions, quadratic functions etc).
</p>
</div>
<div id="outline-container-org3a6c1ef" class="outline-4">
<h4 id="org3a6c1ef"><span class="section-number-4">1.3.1</span> What do we get to select in this learning process</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Well, we can change the learning algorithm and hypothesis set.
Together, they define a <i>learning model</i>.
</p>
</div>
</div>
</div>
<div id="outline-container-org10319b9" class="outline-3">
<h3 id="org10319b9"><span class="section-number-3">1.4</span> Simple Learning Model example, Peceptron</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Can be used when data is linearly seperable and the output y is binary.</li>
<li>Given a data set (x<sub>1</sub>, y<sub>1</sub>), &#x2026; (x<sub>N</sub>, y<sub>N</sub>).</li>
</ul>

<p>
Predict Sign(&Sigma;<sup>N</sup><sub>i=0</sub>(w<sub>i</sub>.x<sub>i</sub>)) where x<sub>0</sub> = 1.
</p>

<p>
How to find the weights w<sub>1</sub>&#x2026;w<sub>d</sub>?
</p>
</div>
<div id="outline-container-orgf93a16b" class="outline-4">
<h4 id="orgf93a16b"><span class="section-number-4">1.4.1</span> Algorithm (Perceptron Learning Algorith, PLA)</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>Initialize all weights to random numbers.</li>
<li>Pick one of the points from (x<sub>i</sub>, y<sub>i</sub>) that has been misclassified. i.e Sign(w<sup>T</sup>.x<sub>n</sub>) &ne; y<sub>n</sub></li>
<li>Update w<sub>(t+1)</sub> = w<sub>t</sub> + y<sub>i</sub>.x<sub>i</sub></li>
</ol>
<p>
Intuitively this makes sense, we 'nudge' the weights in a direction
such that y<sub>i</sub> is classified correctly.
</p>
<ol class="org-ol">
<li>Do this till all points are classified correctly.</li>
</ol>

<p>
Other are other variations to this basic algorithm that will work with
real-values outputs and non-linear data.
</p>
</div>
</div>
</div>
<div id="outline-container-orge6867f6" class="outline-3">
<h3 id="orge6867f6"><span class="section-number-3">1.5</span> Basic Premise of learning</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<i>Use a bunch of observations to uncover an underlying process</i>
</p>

<p>
Broad Permise &rArr; Many variations
</p>

<ul class="org-ul">
<li>Supervised learning</li>
</ul>
<p>
Given a bunch of (input, correct output)&#x2026; Find a hypothesis that
works with new data.
</p>
<ul class="org-ul">
<li>Unsupervised learning</li>
</ul>
<p>
Given a bunch of (input, ?), can we uncover some pattern? Create some
kind of clusters of similar data.
</p>
<ul class="org-ul">
<li>Reinforcement learning</li>
</ul>
<p>
Given (input, ?, grade for an output), can we improve our algorithm
step by step.  Ex) Game playing, grade every move the algorithm makes,
give penalty for bad moves and +ve score for good moves. Overtime, the
algorithm gets better.
</p>
</div>
</div>
</div>
