learning-from-data.org
* 2 - Is Learning Feasible
That's interesting...  Well, the unknown target function can be any
possible function. If we get 1000 data points, there can be multiple
functions that satisfy these 1000 points and yet differ on the 1001Th
point.
** Related Experiment
- Consider a bin filled with red and green marbles. The fraction of
  green marbles in the bin is \mu.
- Lets take a sample of 'N' marbles from this bin. The fraction of
  green marbles in our sample is \nu.

*** How close is \nu to \mu?
Well, we can charaterize this using some inequality from probability.

We'll use the inequality known as Hoeffding's inequality.

P(|\mu - \nu| > \epsilon) \le 2.e^{-2.\epsilon^{2}.N}

The statement "\nu = \mu" is P.A.C (Probably Approximately Correct)
**** What does this mean?
- Good thing, its a negative exponential with N. As N \uparrow the probability \downarrow. 
- Bad thing, there is an \epsilon^2 in the exponent. If we need a tight bound,
  we are going to pay the price.
- Trade of: N, \epsilon, and the bound.
** How does this relate to learning?
- In our bin, the unknown was a number \mu, in learning the unknown is a function /f/.
In both cases, we need to figure out an approximation to the unknown.
- Think of each marble as a point x \in \Chi.
- The color of marble is determined by our hypothesis function /h/.

h(x) = f(x) \Rightarrow Marble is colored green.
h(x) != f(x) \Rightarrow Marble is colored red.

Thus, each bin is characterized by a hypothesis function /h/.
*** So what does this mean?
h is fixed. For a /given h/, \nu generalizes to \mu. (with the hoeffding's bound)

Well, this is just verification, not learning.
Given a particular h, we can take a sample of N points and see what our \nu is.
*** Aside: Update the learning diagram to account for probability
 The reason we are doing this bin analogy and related theory is so that
 we can figure out if learning is possible or not.

 In order to do that, we'll have to account for this /Probability/ in
 our learning diagram. (points in this case)
**** Updated learning diagram
  1) Target Function, f: \Chi \rarr \Upsilon
  2) Training Examples, (x_1, y_1), ... , (x_N, y_N)
  2.5) /The training examples are drawn based on some probability distribution \Rho on \Chi./
  3) Learning Algorithm, \Alpha
  4) Hypothesis Set, \Eta
  5) Learned hypothesis, g \approx f
*** Notation change for Learning
- \mu is 'out of sample' E_out(h).
- \nu is 'in sample' E_in(h).

Thus, the hoeffding inequality becomes,

P(|E_in(h) - E_out(h)| > \epsilon) \le 2e^{-2.\epsilon^{2}.N}
*** Account for multiple hypothesis
We have multiple hypothesis functions, thus, we can have multiple
bins, one for each /h/.

The problem is hoeffding doesn't apply to multiple bins.  (Intuition,
toss a coin 10 times, p(10 heads) = 0.1%, toss 1000 coins, 10 times
each, p(atleast 1 coin getting 10 heads) \approx 63%).

Thus, the chance that in atleast one of the bins, the E_in may not be a
good approximation for E_out and we end up picking that. (like picking
10 green marbles).
*** Simple solution and summary
Once we pick our final hypothesis /g/ (from /h/), we want to know

P[|E_in(g) - E_out(g)| \gt \epsilon]. We want to show that this is pretty small.

We can use the union bound for this. (Its a pretty loose bound). If we have 'M' hypothesis,

P[|E_in(g) - E_out(g)| \gt \epsilon] \le P[|E_in(h_1) - E_out(h_1)| \gt \epsilon] or
                          P[|E_in(g) - E_out(g)| \gt \epsilon] or ... or
                          P[|E_in(h_M) - E_out(h_M)| \gt \epsilon] \le \Sigma^M_{m=1}2.e^{-2.\epsilon^{2}.N}

Thus, *P[|E_in(g) - E_out(g)| \gt \epsilon] \le 2.M.e^{-2.\epsilon^{2}.N}*.

Hmm... So using a lot of hypothesis can lead to bad things happening.

But as we can see, when M is finite, we can learn. i.e E_in will track E_out.

Thus, in  a probabilistic sense learning is feasible.
* 3 - Linear Model 1
** Questions
- Improving regression model, is it possible to accommodate more data
  in a supervised learning problem.
** Real data set
- Consider the supervised learning problem of identifying digits (for say postal code).
*** Input Representation
- A digit is a x_256 vector of pixel values (x_0, x_1 ... x_256). This is wayy too complex and
hard to optimize. Our perceptron algorithm would struggle.
- Instead we can 'extract some features' that are a good representation of the data.
Ex) Symmetry, Intesity.
Now we only have to find weights (w_0, w_1, w_2) which is easier than trying to find (w_0, ... w_256).
** Linear Classification - Perceptron Learning Algorithm
What does PLA do?
- It reduces E_in. (And we hope that E_out tracks E_in, we got this bound last week)
- In case of linearly seperable data, the PLA algorithm converges. But
  for non-seperable data, it cannot converge. Hence we stop after a
  fixed number of iterations.
*** The 'pocket' Algorithm
This is a modification of the perceptron learning algorithm, where we
'remember' the weights for which E_in is the least, and use that as our
final hypothesis /g/.
