dist/learning-from-data.html
<div id="outline-container-org6685410" class="outline-2">
<h2 id="org6685410"><span class="section-number-2">2</span> 2 - Is Learning Feasible</h2>
<div class="outline-text-2" id="text-2">
<p>
That's interesting&#x2026;  Well, the unknown target function can be any
possible function. If we get 1000 data points, there can be multiple
functions that satisfy these 1000 points and yet differ on the 1001Th
point.
</p>
</div>
<div id="outline-container-org431dd73" class="outline-3">
<h3 id="org431dd73"><span class="section-number-3">2.1</span> Related Experiment</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Consider a bin filled with red and green marbles. The fraction of
green marbles in the bin is &mu;.</li>
<li>Lets take a sample of 'N' marbles from this bin. The fraction of
green marbles in our sample is &nu;.</li>
</ul>
</div>

<div id="outline-container-orgb351fc5" class="outline-4">
<h4 id="orgb351fc5"><span class="section-number-4">2.1.1</span> How close is &nu; to &mu;?</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Well, we can charaterize this using some inequality from probability.
</p>

<p>
We'll use the inequality known as Hoeffding's inequality.
</p>

<p>
P(|&mu; - &nu;| &gt; &epsilon;) &le; 2.e<sup>-2.&epsilon;<sup>2</sup>.N</sup>
</p>

<p>
The statement "&nu; = &mu;" is P.A.C (Probably Approximately Correct)
</p>
</div>
<ol class="org-ol">
<li><a id="orgda06f80"></a>What does this mean?<br />
<div class="outline-text-5" id="text-2-1-1-1">
<ul class="org-ul">
<li>Good thing, its a negative exponential with N. As N &uarr; the probability &darr;.</li>
<li>Bad thing, there is an &epsilon;<sup>2</sup> in the exponent. If we need a tight bound,
we are going to pay the price.</li>
<li>Trade of: N, &epsilon;, and the bound.</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgfa862b3" class="outline-3">
<h3 id="orgfa862b3"><span class="section-number-3">2.2</span> How does this relate to learning?</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>In our bin, the unknown was a number &mu;, in learning the unknown is a function <i>f</i>.</li>
</ul>
<p>
In both cases, we need to figure out an approximation to the unknown.
</p>
<ul class="org-ul">
<li>Think of each marble as a point x &isin; &Chi;.</li>
<li>The color of marble is determined by our hypothesis function <i>h</i>.</li>
</ul>

<p>
h(x) = f(x) &rArr; Marble is colored green.
h(x) != f(x) &rArr; Marble is colored red.
</p>

<p>
Thus, each bin is characterized by a hypothesis function <i>h</i>.
</p>
</div>
<div id="outline-container-orgbf3bc3e" class="outline-4">
<h4 id="orgbf3bc3e"><span class="section-number-4">2.2.1</span> So what does this mean?</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
h is fixed. For a <i>given h</i>, &nu; generalizes to &mu;. (with the hoeffding's bound)
</p>

<p>
Well, this is just verification, not learning.
Given a particular h, we can take a sample of N points and see what our &nu; is.
</p>
</div>
</div>
<div id="outline-container-org72c6db5" class="outline-4">
<h4 id="org72c6db5"><span class="section-number-4">2.2.2</span> Aside: Update the learning diagram to account for probability</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
The reason we are doing this bin analogy and related theory is so that
we can figure out if learning is possible or not.
</p>

<p>
In order to do that, we'll have to account for this <i>Probability</i> in
our learning diagram. (points in this case)
</p>
</div>
<ol class="org-ol">
<li><a id="orge1f14ff"></a>Updated learning diagram<br />
<div class="outline-text-5" id="text-2-2-2-1">
<ol class="org-ol">
<li>Target Function, f: &Chi; &rarr; &Upsilon;</li>
<li>Training Examples, (x<sub>1</sub>, y<sub>1</sub>), &#x2026; , (x<sub>N</sub>, y<sub>N</sub>)</li>
</ol>
<p>
2.5) <i>The training examples are drawn based on some probability distribution &Rho; on &Chi;.</i>
</p>
<ol class="org-ol">
<li>Learning Algorithm, &Alpha;</li>
<li>Hypothesis Set, &Eta;</li>
<li>Learned hypothesis, g &asymp; f</li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org981308f" class="outline-4">
<h4 id="org981308f"><span class="section-number-4">2.2.3</span> Notation change for Learning</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>&mu; is 'out of sample' E<sub>out</sub>(h).</li>
<li>&nu; is 'in sample' E<sub>in</sub>(h).</li>
</ul>

<p>
Thus, the hoeffding inequality becomes,
</p>

<p>
P(|E<sub>in</sub>(h) - E<sub>out</sub>(h)| &gt; &epsilon;) &le; 2e<sup>-2.&epsilon;<sup>2</sup>.N</sup>
</p>
</div>
</div>
<div id="outline-container-org6c2e6a0" class="outline-4">
<h4 id="org6c2e6a0"><span class="section-number-4">2.2.4</span> Account for multiple hypothesis</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
We have multiple hypothesis functions, thus, we can have multiple
bins, one for each <i>h</i>.
</p>

<p>
The problem is hoeffding doesn't apply to multiple bins.  (Intuition,
toss a coin 10 times, p(10 heads) = 0.1%, toss 1000 coins, 10 times
each, p(atleast 1 coin getting 10 heads) &asymp; 63%).
</p>

<p>
Thus, the chance that in atleast one of the bins, the E<sub>in</sub> may not be a
good approximation for E<sub>out</sub> and we end up picking that. (like picking
10 green marbles).
</p>
</div>
</div>
<div id="outline-container-orgfb82714" class="outline-4">
<h4 id="orgfb82714"><span class="section-number-4">2.2.5</span> Simple solution and summary</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Once we pick our final hypothesis <i>g</i> (from <i>h</i>), we want to know
</p>

<p>
P[|E<sub>in</sub>(g) - E<sub>out</sub>(g)| &gt; &epsilon;]. We want to show that this is pretty small.
</p>

<p>
We can use the union bound for this. (Its a pretty loose bound). If we have 'M' hypothesis,
</p>

<p>
P[|E<sub>in</sub>(g) - E<sub>out</sub>(g)| &gt; &epsilon;] &le; P[|E<sub>in</sub>(h<sub>1</sub>) - E<sub>out</sub>(h<sub>1</sub>)| &gt; &epsilon;] or
                          P[|E<sub>in</sub>(g) - E<sub>out</sub>(g)| &gt; &epsilon;] or &#x2026; or
                          P[|E<sub>in</sub>(h<sub>M</sub>) - E<sub>out</sub>(h<sub>M</sub>)| &gt; &epsilon;] &le; &Sigma;<sup>M</sup><sub>m=1</sub>2.e<sup>-2.&epsilon;<sup>2</sup>.N</sup>
</p>

<p>
Thus, <b>P[|E<sub>in</sub>(g) - E<sub>out</sub>(g)| &gt; &epsilon;] &le; 2.M.e<sup>-2.&epsilon;<sup>2</sup>.N</sup></b>.
</p>

<p>
Hmm&#x2026; So using a lot of hypothesis can lead to bad things happening.
</p>

<p>
But as we can see, when M is finite, we can learn. i.e E<sub>in</sub> will track E<sub>out</sub>.
</p>

<p>
Thus, in  a probabilistic sense learning is feasible.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org9c41bf2" class="outline-2">
<h2 id="org9c41bf2"><span class="section-number-2">3</span> 3 - Linear Model 1</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3db77b9" class="outline-3">
<h3 id="org3db77b9"><span class="section-number-3">3.1</span> Questions</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Improving regression model, is it possible to accommodate more data
in a supervised learning problem.</li>
</ul>
</div>
</div>
<div id="outline-container-orga86e355" class="outline-3">
<h3 id="orga86e355"><span class="section-number-3">3.2</span> Real data set</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Consider the supervised learning problem of identifying digits (for say postal code).</li>
</ul>
</div>
<div id="outline-container-org7252c08" class="outline-4">
<h4 id="org7252c08"><span class="section-number-4">3.2.1</span> Input Representation</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>A digit is a x<sub>256</sub> vector of pixel values (x<sub>0</sub>, x<sub>1</sub> &#x2026; x<sub>256</sub>). This is wayy too complex and</li>
</ul>
<p>
hard to optimize. Our perceptron algorithm would struggle.
</p>
<ul class="org-ul">
<li>Instead we can 'extract some features' that are a good representation of the data.</li>
</ul>
<p>
Ex) Symmetry, Intesity.
Now we only have to find weights (w<sub>0</sub>, w<sub>1</sub>, w<sub>2</sub>) which is easier than trying to find (w<sub>0</sub>, &#x2026; w<sub>256</sub>).
</p>
</div>
</div>
</div>
<div id="outline-container-org274718e" class="outline-3">
<h3 id="org274718e"><span class="section-number-3">3.3</span> Linear Classification - Perceptron Learning Algorithm</h3>
<div class="outline-text-3" id="text-3-3">
<p>
What does PLA do?
</p>
<ul class="org-ul">
<li>It reduces E<sub>in</sub>. (And we hope that E<sub>out</sub> tracks E<sub>in</sub>, we got this bound last week)</li>
<li>In case of linearly seperable data, the PLA algorithm converges. But
for non-seperable data, it cannot converge. Hence we stop after a
fixed number of iterations.</li>
</ul>
</div>
<div id="outline-container-org0f5a26f" class="outline-4">
<h4 id="org0f5a26f"><span class="section-number-4">3.3.1</span> The 'pocket' Algorithm</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
This is a modification of the perceptron learning algorithm, where we
'remember' the weights for which E<sub>in</sub> is the least, and use that as our
final hypothesis <i>g</i>.
</p>
</div>
</div>
</div>
