learning-from-data.org
** Linear Regression
Regression - 'real valued output'. Thats all it means. The term comes
from earlier work in statistics, there was so much work on it that
people could not get rid of the term. All it means is the output is
real valued.

Ex) Credit line (dollar amount) In the classification example, we
approved or denied credit based on past customers, using linear
regression we can try and predict the actual credit line. How much
credit should we give a person?

Input x = list of features like {age, salary, years in residence, years in job, current debt ...}

Linear regression output: 

h(x) = \Sigma^{d}_{i=0} w_{i}.x_{i} = w^{T}.x = "real value"

w = weight vector [w_0, w_1 ... w_d]
x = 1 training example [x_0, x_1 ... x_d]

This is called 'linear regression' because the form in terms of the input 'x' is linear.
*** What is linear regression trying to find

In our credit line example,

We have our input training examples as (x_1, y_1), (x_2, y_2), ... (x_N, y_N)

Each y_n is a 'real value', the approved credit amount for the input x_n.

Linear regression tries to replicate this behavior.
*** How to measure error
How well does h(x) approximate f(x) (the target function)? 
For every example x_i, the given output value is y_i and the predicted value is h(x_i).

We can define many error measures (we'll get to this in unit 4).

For now, we'll pick a convenient (we'll see why) error measure, /the squared error/.

(h(x) - y)^2

The average squared error for all our input points is:

in-sample error, E_in(h) = 1/N * \Sigma^N_{n=1}.(h(x_n) - f(x_n))^2

Our algorithm tries to minimize this error.  The approximation our
'linear' model comes up with is a hyperplane (one-dimenstion short of
the space we are working with).
*** Expression for E_in
Let's try to write this in vector form.

TODO :: seems like small caps doesn't work with mathjax, need to fix the x to be smallcap(x).

\begin{equation}
\begin{split}
E_{in}(w)	&= \frac{1}{N} \Sigma^N_{n=1}(w^{T}.x_n - y_n)^2 \\
 &= \frac{1}{N} || X.w - y ||^2
\end{split}
\end{equation}

where X:
\begin{bmatrix} 
\ldots & x_1^T & \ldots  \\
\ldots & x_2^T & \ldots  \\
\ldots & \vdots & \ldots  \\
\ldots & x_N^T & \ldots  \\
\end{bmatrix}

w:
\begin{bmatrix}
w_1 \\
w_2 \\
\vdots \\
w_d
\end{bmatrix}

y:

\begin{bmatrix}
y_1 \\
y_2 \\
\vdots \\
y_N
\end{bmatrix}
*** Minimizing E_in
We can use some matrix calculus and find the min of our E_in expression.
\begin{equation}
\begin{split}
E_{in}(w) & = \frac{1}{N}||Xw - y||^2 \\
\nabla.E_{in}(w) & = \frac{2}{N} X^T||Xw - y|| = 0
\end{split}
\end{equation}

Solving for w, we get

$$ X^{T}Xw = X^{T}.y $$
$$ w = X^{\dagger}.y $$

where $X^{\dagger} = (X^{T}.X)^{-1}.X^{T}$
This is called the 'pseudo-inverse' of X.
X being non-invertible does not have an inverse, but the pseudo-inverse is pretty interesting. 

$X.X^{\dagger} = I$. So it is an inverse
in some sense. ( $X.X^{\dagger}$ is not identity. Hence the
pseudo).
**** From a computational standpoint, its a nice quantity
$$X^{\dagger} = (X^{T}.X)^{-1}.X^{T}$$

X is (N * d+1)
X^T is (d+1 * N)

Thus X^{T}.X is (d+1 * d+1)

Usually, our d is small and N is large. Luckily our inverse is a fairly 'small' matrix :)
There are many packages that compute this quantity.

The final matrix X^\dagger has dimensions  (d+1 *  N)

X^{\dagger}.y has dimensions (d+1 * 1) as expected. (for the weights)
*** The linear regression algorithm
1) Construct X and y using the training examples.
2) Compute pseudo-inverse $X^{\dagger} = (X^{T}.X)^{-1}.X^{T}.
3) return $w = X^{\dagger}.y$.
Done! boom! (one-step learning ;))

Since its so straight forward, it can be used as a component in many other learning algorithms.
*** Linear regression for classification

Classification is just a special case of regression right? The output is 1 or -1, which is a real-value.
Can we use linear regression for that?

We can define our final output as sign(w^{T}.x). The assumption here is
that w^{T}.x will be negative for examples with -1, and positive for
examples with output +1.

However, our regression algorithms doesn't quite work for
classification as our error measure is 'squared error'.

Our algorithm simultaneously tries to make all points close to + or -
1, but the extreme points affect our error more, hence the linear boundary is not very good.

Instead, what we can do is use linear regression for setting our
initial set of weights for the 'pocket' algorithm! (instead of
starting with 0s).
** Nonlinear transformation
In real life, data is not always linearly seperable.

For example, consider a circular decision boundary, where inside circle, all points are +1 and outside -1.

Can we come up with this kind of a 'circular' hypothesis function that seperates the data?
Yes, but the problem is thats not linear.

Can we do that with linear models?
The answer is yes.
*** Linear in what?
Regression implements

$$ y = \Sigma^{d}_{i=0}x_{i}.w_{i} $$

For classification

$$ y = sign(\Sigma^{d}_{i=0}x_{i}.w_{i})$$

The algorithm works because of linearity in the 'weights' not x's. 
w^{T}.x is linear in /w/.

Thus, we can add 'features' that are non-linearly functions of x (like
3.x_{d1}.x^2_{d2} etc) and apply our linear model algorithm.
* 4 - Error and Noise
** Non-Linear transormation continued
Intuitive idea, Take a point in input space x and transform it using
some non-linear function of x, find weights in this new space and use
that to predict y.

This trick can be used to create arbitrarilty complex dimensions and learn.
*** Why does it work?
Any non-linear dependency in one subspace can be treated as a linear
dependency in a more complex space.

Ex) A circular boundary (x_1^2 + x_2^2) varies linearly in a space that
has x_1^2 and x_2^2 as dimensions.
