dist/learning-from-data.html
<div id="outline-container-orga5ae607" class="outline-3">
<h3 id="orga5ae607"><span class="section-number-3">3.4</span> Linear Regression</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Regression - 'real valued output'. Thats all it means. The term comes
from earlier work in statistics, there was so much work on it that
people could not get rid of the term. All it means is the output is
real valued.
</p>

<p>
Ex) Credit line (dollar amount) In the classification example, we
approved or denied credit based on past customers, using linear
regression we can try and predict the actual credit line. How much
credit should we give a person?
</p>

<p>
Input x = list of features like {age, salary, years in residence, years in job, current debt &#x2026;}
</p>

<p>
Linear regression output: 
</p>

<p>
h(x) = &Sigma;<sup>d</sup><sub>i=0</sub> w<sub>i</sub>.x<sub>i</sub> = w<sup>T</sup>.x = "real value"
</p>

<p>
w = weight vector [w<sub>0</sub>, w<sub>1</sub> &#x2026; w<sub>d</sub>]
x = 1 training example [x<sub>0</sub>, x<sub>1</sub> &#x2026; x<sub>d</sub>]
</p>

<p>
This is called 'linear regression' because the form in terms of the input 'x' is linear.
</p>
</div>
<div id="outline-container-orgf78ef63" class="outline-4">
<h4 id="orgf78ef63"><span class="section-number-4">3.4.1</span> What is linear regression trying to find</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
In our credit line example,
</p>

<p>
We have our input training examples as (x<sub>1</sub>, y<sub>1</sub>), (x<sub>2</sub>, y<sub>2</sub>), &#x2026; (x<sub>N</sub>, y<sub>N</sub>)
</p>

<p>
Each y<sub>n</sub> is a 'real value', the approved credit amount for the input x<sub>n</sub>.
</p>

<p>
Linear regression tries to replicate this behavior.
</p>
</div>
</div>
<div id="outline-container-org36c8a46" class="outline-4">
<h4 id="org36c8a46"><span class="section-number-4">3.4.2</span> How to measure error</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
How well does h(x) approximate f(x) (the target function)? 
For every example x<sub>i</sub>, the given output value is y<sub>i</sub> and the predicted value is h(x<sub>i</sub>).
</p>

<p>
We can define many error measures (we'll get to this in unit 4).
</p>

<p>
For now, we'll pick a convenient (we'll see why) error measure, <i>the squared error</i>.
</p>

<p>
(h(x) - y)<sup>2</sup>
</p>

<p>
The average squared error for all our input points is:
</p>

<p>
in-sample error, E<sub>in</sub>(h) = 1/N * &Sigma;<sup>N</sup><sub>n=1</sub>.(h(x<sub>n</sub>) - f(x<sub>n</sub>))<sup>2</sup>
</p>

<p>
Our algorithm tries to minimize this error.  The approximation our
'linear' model comes up with is a hyperplane (one-dimenstion short of
the space we are working with).
</p>
</div>
</div>
<div id="outline-container-orgab1e076" class="outline-4">
<h4 id="orgab1e076"><span class="section-number-4">3.4.3</span> Expression for E<sub>in</sub></h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
Let's try to write this in vector form.
</p>

<p>
TODO :: seems like small caps doesn't work with mathjax, need to fix the x to be smallcap(x).
</p>

\begin{equation}
\begin{split}
E_{in}(w)	&= \frac{1}{N} \Sigma^N_{n=1}(w^{T}.x_n - y_n)^2 \\
 &= \frac{1}{N} || X.w - y ||^2
\end{split}
\end{equation}

<p>
where X:
</p>
\begin{bmatrix} 
\ldots & x_1^T & \ldots  \\
\ldots & x_2^T & \ldots  \\
\ldots & \vdots & \ldots  \\
\ldots & x_N^T & \ldots  \\
\end{bmatrix}

<p>
w:
</p>
\begin{bmatrix}
w_1 \\
w_2 \\
\vdots \\
w_d
\end{bmatrix}

<p>
y:
</p>

\begin{bmatrix}
y_1 \\
y_2 \\
\vdots \\
y_N
\end{bmatrix}
</div>
</div>
<div id="outline-container-orgfc6b931" class="outline-4">
<h4 id="orgfc6b931"><span class="section-number-4">3.4.4</span> Minimizing E<sub>in</sub></h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
We can use some matrix calculus and find the min of our E<sub>in</sub> expression.
</p>
\begin{equation}
\begin{split}
E_{in}(w) & = \frac{1}{N}||Xw - y||^2 \\
\nabla.E_{in}(w) & = \frac{2}{N} X^T||Xw - y|| = 0
\end{split}
\end{equation}

<p>
Solving for w, we get
</p>

<p>
\[ X^{T}Xw = X^{T}.y \]
\[ w = X^{\dagger}.y \]
</p>

<p>
where \(X^{\dagger} = (X^{T}.X)^{-1}.X^{T}\)
This is called the 'pseudo-inverse' of X.
X being non-invertible does not have an inverse, but the pseudo-inverse is pretty interesting. 
</p>

<p>
\(X.X^{\dagger} = I\). So it is an inverse
in some sense. ( \(X.X^{\dagger}\) is not identity. Hence the
pseudo).
</p>
</div>
<ol class="org-ol">
<li><a id="org891fc46"></a>From a computational standpoint, its a nice quantity<br />
<div class="outline-text-5" id="text-3-4-4-1">
<p>
\[X^{\dagger} = (X^{T}.X)^{-1}.X^{T}\]
</p>

<p>
X is (N * d+1)
X<sup>T</sup> is (d+1 * N)
</p>

<p>
Thus X<sup>T</sup>.X is (d+1 * d+1)
</p>

<p>
Usually, our d is small and N is large. Luckily our inverse is a fairly 'small' matrix :)
There are many packages that compute this quantity.
</p>

<p>
The final matrix X^&dagger; has dimensions  (d+1 *  N)
</p>

<p>
X<sup>&dagger;</sup>.y has dimensions (d+1 * 1) as expected. (for the weights)
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc7b78fa" class="outline-4">
<h4 id="orgc7b78fa"><span class="section-number-4">3.4.5</span> The linear regression algorithm</h4>
<div class="outline-text-4" id="text-3-4-5">
<ol class="org-ol">
<li>Construct X and y using the training examples.</li>
<li>Compute pseudo-inverse $X<sup>&dagger;</sup> = (X<sup>T</sup>.X)<sup>-1</sup>.X<sup>T</sup>.</li>
<li>return \(w = X^{\dagger}.y\).</li>
</ol>
<p>
Done! boom! (one-step learning ;))
</p>

<p>
Since its so straight forward, it can be used as a component in many other learning algorithms.
</p>
</div>
</div>
<div id="outline-container-org595bc4c" class="outline-4">
<h4 id="org595bc4c"><span class="section-number-4">3.4.6</span> Linear regression for classification</h4>
<div class="outline-text-4" id="text-3-4-6">
<p>
Classification is just a special case of regression right? The output is 1 or -1, which is a real-value.
Can we use linear regression for that?
</p>

<p>
We can define our final output as sign(w<sup>T</sup>.x). The assumption here is
that w<sup>T</sup>.x will be negative for examples with -1, and positive for
examples with output +1.
</p>

<p>
However, our regression algorithms doesn't quite work for
classification as our error measure is 'squared error'.
</p>

<p>
Our algorithm simultaneously tries to make all points close to + or -
1, but the extreme points affect our error more, hence the linear boundary is not very good.
</p>

<p>
Instead, what we can do is use linear regression for setting our
initial set of weights for the 'pocket' algorithm! (instead of
starting with 0s).
</p>
</div>
</div>
</div>
<div id="outline-container-org9a6a90f" class="outline-3">
<h3 id="org9a6a90f"><span class="section-number-3">3.5</span> Nonlinear transformation</h3>
<div class="outline-text-3" id="text-3-5">
<p>
In real life, data is not always linearly seperable.
</p>

<p>
For example, consider a circular decision boundary, where inside circle, all points are +1 and outside -1.
</p>

<p>
Can we come up with this kind of a 'circular' hypothesis function that seperates the data?
Yes, but the problem is thats not linear.
</p>

<p>
Can we do that with linear models?
The answer is yes.
</p>
</div>
<div id="outline-container-org8996f4d" class="outline-4">
<h4 id="org8996f4d"><span class="section-number-4">3.5.1</span> Linear in what?</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Regression implements
</p>

<p>
\[ y = \Sigma^{d}_{i=0}x_{i}.w_{i} \]
</p>

<p>
For classification
</p>

<p>
\[ y = sign(\Sigma^{d}_{i=0}x_{i}.w_{i})\]
</p>

<p>
The algorithm works because of linearity in the 'weights' not x's. 
w<sup>T</sup>.x is linear in <i>w</i>.
</p>

<p>
Thus, we can add 'features' that are non-linearly functions of x (like
3.x<sub>d1</sub>.x<sup>2</sup><sub>d2</sub> etc) and apply our linear model algorithm.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6925251" class="outline-2">
<h2 id="org6925251"><span class="section-number-2">4</span> 4 - Error and Noise</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org65bf417" class="outline-3">
<h3 id="org65bf417"><span class="section-number-3">4.1</span> Non-Linear transormation continued</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Intuitive idea, Take a point in input space x and transform it using
some non-linear function of x, find weights in this new space and use
that to predict y.
</p>

<p>
This trick can be used to create arbitrarilty complex dimensions and learn.
</p>
</div>
<div id="outline-container-org24a5af7" class="outline-4">
<h4 id="org24a5af7"><span class="section-number-4">4.1.1</span> Why does it work?</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Any non-linear dependency in one subspace can be treated as a linear
dependency in a more complex space.
</p>

<p>
Ex) A circular boundary (x<sub>1</sub><sup>2</sup> + x<sub>2</sub><sup>2</sup>) varies linearly in a space that
has x<sub>1</sub><sup>2</sup> and x<sub>2</sub><sup>2</sup> as dimensions.
</p>
</div>
</div>
