learning-from-data.org
*** What transforms to what 
We apply a transformation \phi that maps X -> Z

Input point (x_1, x_2 ... x_d) -> (z_1 ... z_{\tilde{d}}) 
All the input data in transformed (x_1 ... x_N) -> (z_1 ... z_N)
Find weights \tilde{w} in Z space (dims = \tilde{d+1}) (w_0, w_1 ... w_{\tilde{d}}
Output remains same (y_1, ... y_N) -> (y_1 ... y_N)

Final hypothesis g(x) = sign(\tilde{w}^{T}.z) = sign(~{w}^{T}.\phi(x))
** Error Measures
What does "h \approx f" mean?

This is what is quantified by an Error Measure.

$$E(h, f)$$

This is actually a functional that takes 2 functions and returns a
function E. However, in most cases we can think of E being a pointwise
error measure.

Pointwise error e(h(x), f(x)). 
examples:
- squared error (h(x) - f(x))^2
- binary error { 0 if h(x) = f(x) else 1}

Overall error E(h, f) = average of pointwise errors = e(h(x), f(x))

In-sample error, 

$$ E_{in}(h) = \frac{1}{N} \Sigma^N_{(n=1)}e(h(x_n), f(x_n)) $$

Simple average. Makes sense.

Out-of sample error, is the expected value over all points in our input space.

$$ E_{out}(h) = E_{x}[e(h(x), f(x))] $$

** How to choose an error measure
- Ideally, the error measure chosen should always be domain specific
  and specified by the user.
(See slides for the supermarket and CIA example, where the cost of a
false accept/ false reject is very different).
- In the absense of this knowledge, we pick error measures that are
1) Plausible. 
2) Fiendly (easy to work with), gives a closed form solution.
ex) Squared error. (gave a closed form solution for the linear regression model)
** Noisy targets
In reality, we rarely get a clean target function. We'll mostly have
to work with noisy targets.

Ex) In the credit approval example, is it possible that 2 people, who
have the same values for all the d dimensions, have different
decisions?

yup! Our features may not capture everything there possibly is for
credit approval. Thus, 2 identical customers => 2 different behaviours.

Hence, our target function /f/ is not a function. (A function can't map
a point in domain to different points in the codomain)

Instead of $y = f(x)$, We have a target distribution, $P(y|x)$

Thus, $(x, y)$ is now generated by a joint distribution:

$$ P(x).P(y|x) $$

Noisy Target = deterministic target f(x) = E[y|x] plus noise y - f(x).

** Components of Learning (including noisy targets)

1) Unknown Target Distribution P(y|x).

target function f(x) X -> Y plus noise y - f(x)
E[y|x] plus y - f(x)

1) Training Examples, (x_1, y_1), ... , (x_N, y_N)
2) /The training examples are drawn based on some probability distribution \Rho on \Chi and the taget distribution P(y|x) on y/
3) Learning Algorithm, \Alpha
4) Error Measure E(h, f)
5) Hypothesis Set, \Eta
6) Learned hypothesis, g \approx f
** Distinction between P(y|x) and P(x)
- P(x) was introduced to accommodate the hoeffding's inequality.
- P(y|x) gives the probability of a particular y given x.
- Each training point is generated based on this. ('multiply' the two
  to get the probability of a point (x, y))

Differences between the two:
- P(y|x) is what our algorithm tries to learn.
- The input distribution P(x) quanties the relative importance of a
  point x. (but we don't learn this)
- Merging P(x) and P(y|x) as P(x, y) mixes two concepts.
Our target distribution is only P(y|x).
** Preamble to the theory
*** What do we know so far?

We proved that E_out(h) \approx E_in(h) based on some bound.
All this means is that E_in is a good proxy for E_out.

For us to learn, we have to find g \approx f, which means E_{out}(g) \approx 0.

$E_out \approx E_in$ means good generalization.
*** Full story of learning has 2 questions
E_out(g) \approx 0 is achieved through:

E_out(g) \approx E_in(g) AND E_{in}(g) \approx 0.

1) Can we make sure that E_out(g) is close to E_{in}(g)?
2) Can we make E_{in}(g) small enough to have learned?

Good stuff!
* 5 - Training vs Testing
** What is the difference between training and testing?

From our previous discussions, hoeffding inequality for $E_{in}, E_{out}$

Testing:

$$ P[ |E_{in} - E_{out}| \gt \epsilon ] \le 2.e^{-2.\epsilon^{2}.N} $$

Training: 

$$ P[ |E_{in} - E_{out}| \gt \epsilon ] \le 2.M.e^{-2.\epsilon^{2}.N} $$

In case of testing, we have already fixed a hypothesis, and we see
what are the chances that it will generalize to E_{out}.

In training, we go through a bunch of hyposthesis, to figure out which
is the best one, that minimizes E_{in}. This 'contaminates' our ability
to generalize.

The goal in the next 2 lectures, will be to replace this /M/ with a
tighter bound. 
** Where did M come from?
Bad events B_1, B_2 ... B_{m} are given by

$$ |E_{in}(m) - E_{out}(m)| > \epsilon $$

i.e, for a given hypothesis, if $|E_{in}(m) - E_{out}(m)| \gt \epsilon$,
then its a bad event. We wanted to know what's the probability that
our final hypothesis is bad... Well, we know the final hypothesis will
be bad, if any of our hypothesis is bad.

Thus, we tried to find a bound on:

$$ P[B_{1} or B_{2} or ... B_{M}] $$

This is where we used the union bound and said that its less than the
sum of probabilities of each of the hypothesis being bad.

Now this bound predicts:

$$ P[B_{1} or B_{2} or ... B_{M}] \le P[B_{1}] + P[B_{2}] + ... P[B_{M}] $$

This is a very loose bound, and does not take into consideration the
overlap of the bad events Bs'.
** Can we improve M?
Note: The full proof is available in the book. These notes just give
an intuitive feel for the idea.

Yup, as bad events are very overlapping.

To see this, consider a hypothesis h_1. Let points {x_1, x_2, ... x_n}
be our training points.

Now, h_1 classifies each of these points as +1 or -1.
Consider another hypothesis h_2, which also classifies these points as +1 and -1.

Let's say h_1, h_2 show the same classification for all of our
training points, but vary slightly outside of E_in.

This means, |E_{in}(h_1) - E_{out}(h_1)| (say 1)
\approx |E_{in}(h_2) - E_{out}(h_2)| (say 2).

