dist/learning-from-data.html
<div id="outline-container-orgf12c76d" class="outline-4">
<h4 id="orgf12c76d"><span class="section-number-4">4.1.2</span> What transforms to what</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
We apply a transformation &phi; that maps X -&gt; Z
</p>

<p>
Input point (x<sub>1</sub>, x<sub>2</sub> &#x2026; x<sub>d</sub>) -&gt; (z<sub>1</sub> &#x2026; z<sub>~{d}</sub>) 
All the input data in transformed (x<sub>1</sub> &#x2026; x<sub>N</sub>) -&gt; (z<sub>1</sub> &#x2026; z<sub>N</sub>)
Find weights ~{w} in Z space (dims = ~{d+1}) (w<sub>0</sub>, w<sub>1</sub> &#x2026; w<sub>~{d}</sub>
Output remains same (y<sub>1</sub>, &#x2026; y<sub>N</sub>) -&gt; (y<sub>1</sub> &#x2026; y<sub>N</sub>)
</p>

<p>
Final hypothesis g(x) = sign(~{w}<sup>T</sup>.z) = sign(~{w}<sup>T</sup>.&phi;(x))
</p>
</div>
</div>
</div>
<div id="outline-container-org3ecdac5" class="outline-3">
<h3 id="org3ecdac5"><span class="section-number-3">4.2</span> Error Measures</h3>
<div class="outline-text-3" id="text-4-2">
<p>
What does "h &asymp; f" mean?
</p>

<p>
This is what is quantified by an Error Measure.
</p>

<p>
\[E(h, f)\]
</p>

<p>
This is actually a functional that takes 2 functions and returns a
function E. However, in most cases we can think of E being a pointwise
error measure.
</p>

<p>
Pointwise error e(h(x), f(x)). 
examples:
</p>
<ul class="org-ul">
<li>squared error (h(x) - f(x))<sup>2</sup></li>
<li>binary error { 0 if h(x) = f(x) else 1}</li>
</ul>

<p>
Overall error E(h, f) = average of pointwise errors = e(h(x), f(x))
</p>

<p>
In-sample error, 
</p>

<p>
\[ E_{in}(h) = \frac{1}{N} \Sigma^N_{(n=1)}e(h(x_n), f(x_n)) \]
</p>

<p>
Simple average. Makes sense.
</p>

<p>
Out-of sample error, is the expected value over all points in our input space.
</p>

<p>
\[ E_{out}(h) = E_{x}[e(h(x), f(x))] \]
</p>
</div>
</div>

<div id="outline-container-org34c2d0f" class="outline-3">
<h3 id="org34c2d0f"><span class="section-number-3">4.3</span> How to choose an error measure</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Ideally, the error measure chosen should always be domain specific
and specified by the user.</li>
</ul>
<p>
(See slides for the supermarket and CIA example, where the cost of a
false accept/ false reject is very different).
</p>
<ul class="org-ul">
<li>In the absense of this knowledge, we pick error measures that are</li>
<li>Plausible.</li>
<li>Fiendly (easy to work with), gives a closed form solution.</li>
</ul>
<p>
ex) Squared error. (gave a closed form solution for the linear regression model)
</p>
</div>
</div>
<div id="outline-container-org9ae7575" class="outline-3">
<h3 id="org9ae7575"><span class="section-number-3">4.4</span> Noisy targets</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In reality, we rarely get a clean target function. We'll mostly have
to work with noisy targets.
</p>

<p>
Ex) In the credit approval example, is it possible that 2 people, who
have the same values for all the d dimensions, have different
decisions?
</p>

<p>
yup! Our features may not capture everything there possibly is for
credit approval. Thus, 2 identical customers =&gt; 2 different behaviours.
</p>

<p>
Hence, our target function <i>f</i> is not a function. (A function can't map
a point in domain to different points in the codomain)
</p>

<p>
Instead of \(y = f(x)\), We have a target distribution, \(P(y|x)\)
</p>

<p>
Thus, \((x, y)\) is now generated by a joint distribution:
</p>

<p>
\[ P(x).P(y|x) \]
</p>

<p>
Noisy Target = deterministic target f(x) = E[y|x] plus noise y - f(x).
</p>
</div>
</div>

<div id="outline-container-org72cd61c" class="outline-3">
<h3 id="org72cd61c"><span class="section-number-3">4.5</span> Components of Learning (including noisy targets)</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li>Unknown Target Distribution P(y|x).</li>
</ol>

<p>
target function f(x) X -&gt; Y plus noise y - f(x)
E[y|x] plus y - f(x)
</p>

<ol class="org-ol">
<li>Training Examples, (x<sub>1</sub>, y<sub>1</sub>), &#x2026; , (x<sub>N</sub>, y<sub>N</sub>)</li>
<li><i>The training examples are drawn based on some probability distribution &Rho; on &Chi; and the taget distribution P(y|x) on y</i></li>
<li>Learning Algorithm, &Alpha;</li>
<li>Error Measure E(h, f)</li>
<li>Hypothesis Set, &Eta;</li>
<li>Learned hypothesis, g &asymp; f</li>
</ol>
</div>
</div>
<div id="outline-container-org7b5f7b9" class="outline-3">
<h3 id="org7b5f7b9"><span class="section-number-3">4.6</span> Distinction between P(y|x) and P(x)</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>P(x) was introduced to accommodate the hoeffding's inequality.</li>
<li>P(y|x) gives the probability of a particular y given x.</li>
<li>Each training point is generated based on this. ('multiply' the two
to get the probability of a point (x, y))</li>
</ul>

<p>
Differences between the two:
</p>
<ul class="org-ul">
<li>P(y|x) is what our algorithm tries to learn.</li>
<li>The input distribution P(x) quanties the relative importance of a
point x. (but we don't learn this)</li>
<li>Merging P(x) and P(y|x) as P(x, y) mixes two concepts.</li>
</ul>
<p>
Our target distribution is only P(y|x).
</p>
</div>
</div>
<div id="outline-container-orga79b502" class="outline-3">
<h3 id="orga79b502"><span class="section-number-3">4.7</span> Preamble to the theory</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-org56b6044" class="outline-4">
<h4 id="org56b6044"><span class="section-number-4">4.7.1</span> What do we know so far?</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
We proved that E<sub>out</sub>(h) &asymp; E<sub>in</sub>(h) based on some bound.
All this means is that E<sub>in</sub> is a good proxy for E<sub>out</sub>.
</p>

<p>
For us to learn, we have to find g &asymp; f, which means E<sub>out</sub>(g) &asymp; 0.
</p>

<p>
\(E_out \approx E_in\) means good generalization.
</p>
</div>
</div>
<div id="outline-container-org537a824" class="outline-4">
<h4 id="org537a824"><span class="section-number-4">4.7.2</span> Full story of learning has 2 questions</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
E<sub>out</sub>(g) &asymp; 0 is achieved through:
</p>

<p>
E<sub>out</sub>(g) &asymp; E<sub>in</sub>(g) AND E<sub>in</sub>(g) &asymp; 0.
</p>

<ol class="org-ol">
<li>Can we make sure that E<sub>out</sub>(g) is close to E<sub>in</sub>(g)?</li>
<li>Can we make E<sub>in</sub>(g) small enough to have learned?</li>
</ol>

<p>
Good stuff!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org79cb895" class="outline-2">
<h2 id="org79cb895"><span class="section-number-2">5</span> 5 - Training vs Testing</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgda1fda0" class="outline-3">
<h3 id="orgda1fda0"><span class="section-number-3">5.1</span> What is the difference between training and testing?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
From our previous discussions, hoeffding inequality for \(E_{in}, E_{out}\)
</p>

<p>
Testing:
</p>

<p>
\[ P[ |E_{in} - E_{out}| \gt \epsilon ] \le 2.e^{-2.\epsilon^{2}.N} \]
</p>

<p>
Training: 
</p>

<p>
\[ P[ |E_{in} - E_{out}| \gt \epsilon ] \le 2.M.e^{-2.\epsilon^{2}.N} \]
</p>

<p>
In case of testing, we have already fixed a hypothesis, and we see
what are the chances that it will generalize to E<sub>out</sub>.
</p>

<p>
In training, we go through a bunch of hyposthesis, to figure out which
is the best one, that minimizes E<sub>in</sub>. This 'contaminates' our ability
to generalize.
</p>

<p>
The goal in the next 2 lectures, will be to replace this <i>M</i> with a
tighter bound. 
</p>
</div>
</div>
<div id="outline-container-orga8cbb71" class="outline-3">
<h3 id="orga8cbb71"><span class="section-number-3">5.2</span> Where did M come from?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Bad events B<sub>1</sub>, B<sub>2</sub> &#x2026; B<sub>m</sub> are given by
</p>

<p>
\[ |E_{in}(m) - E_{out}(m)| > \epsilon \]
</p>

<p>
i.e, for a given hypothesis, if \(|E_{in}(m) - E_{out}(m)| \gt \epsilon\),
then its a bad event. We wanted to know what's the probability that
our final hypothesis is bad&#x2026; Well, we know the final hypothesis will
be bad, if any of our hypothesis is bad.
</p>

<p>
Thus, we tried to find a bound on:
</p>

<p>
\[ P[B_{1} or B_{2} or ... B_{M}] \]
</p>

<p>
This is where we used the union bound and said that its less than the
sum of probabilities of each of the hypothesis being bad.
</p>

<p>
Now this bound predicts:
</p>

<p>
\[ P[B_{1} or B_{2} or ... B_{M}] \le P[B_{1}] + P[B_{2}] + ... P[B_{M}] \]
</p>

<p>
This is a very loose bound, and does not take into consideration the
overlap of the bad events Bs'.
</p>
</div>
</div>
<div id="outline-container-org9f12b1c" class="outline-3">
<h3 id="org9f12b1c"><span class="section-number-3">5.3</span> Can we improve M?</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Note: The full proof is available in the book. These notes just give
an intuitive feel for the idea.
</p>

<p>
Yup, as bad events are very overlapping.
</p>

<p>
To see this, consider a hypothesis h<sub>1</sub>. Let points {x<sub>1</sub>, x<sub>2</sub>, &#x2026; x<sub>n</sub>}
be our training points.
</p>

<p>
Now, h<sub>1</sub> classifies each of these points as +1 or -1.
Consider another hypothesis h<sub>2</sub>, which also classifies these points as +1 and -1.
</p>

<p>
Let's say h<sub>1</sub>, h<sub>2</sub> show the same classification for all of our
training points, but vary slightly outside of E<sub>in</sub>.
</p>

<p>
This means, |E<sub>in</sub>(h<sub>1</sub>) - E<sub>out</sub>(h<sub>1</sub>)| (say 1)
&asymp; |E<sub>in</sub>(h<sub>2</sub>) - E<sub>out</sub>(h<sub>2</sub>)| (say 2).
</p>
</div>
