learning-from-data.org
*** Why do we care about this? 
That's because if P[1 > \epsilon], P[2 > \epsilon] is also pretty
high.
*** Dichotomies (mini-hypothesis)

A hypothesis $h: X -> {+1, -1}$.
A dichotomy $h: x_{1}, x_{2} ... x_{N} -> {+1, -1}$

Thus, a dichotomy is defined only on points in the input space.

Number of hypothesis |H| can be infinite, but number of dichotomies can be atmost 2^{N}.

Dichotomy is a candidate for replacing /M/.

*** Growth Funciton
Growth function $m_H(N)$ is defined as the most number of dichotomies on any 'N' points.

What does that mean? Pick any set of 'N' points from the input space,
such that maximum number of dichotomies can be realized.

$$ m_H(N) = max_{x_{1}, x_{2} ... x_{N}}|H(x_{1} ... x_{N}|. $$

Also $m_H(N) \le 2^N$

For example, lets take the perceptron model in 2-D space.

- Given N = 3, we can arrange 3 points in a way such that all possible
  2^3 = 8 dichotomies can be realized.

Thus, $m_H(3) = 2^3$ (Maximum possible dichotomies)

- Given N = 4, no matter how we arrange 4 points, we cannot get all
  possible dichotomies of 2^4 = 16. We'll get something less than
  2^4. (Actual value is 14)
*** key terms: Shattering and Breakpoint
We call 'N' points as being /shattered/ by a hypothesis set, if we can
realize all possible 2^N possibilities.

Definition: If no dataset of size 'k' can be /shattered/ by a
hypothesis set /H/, then k is a /breakpoint/ for /H/.

Ex) The breakpoint for 2-D perceptron is 4. $m_H(k) \lt 2^{m}$

No break point => $m_H(N) = 2^{N}$

Any break point => $m_H(N) \lt 2^{N}$
*** What can we do with this stuff?
We had,

$$ P[ |E_{in} - E_{out}| \gt \epsilon ]  \le 2.M.e^{-2.\epsilon^{2}.N} $$

Here is what we can try to do, if we can replace /M/ with m_H(N) and
prove that m_H(N) is polynomial, then we can get a finite bound on
P[B_{1} or B_{2} ... B_{N}], that is finite even for an infinite hypothesis
sets.
* 6 - Theory of generalization
** 2 things to prove
- Prove that $m_H(N)$ is polynomial.
- Proof that $m_H(N)$ can replace M.
** Bounding $m_H(N)$
The goal is to show $m_H(N)$ \le a polynomial.

Checkout lectures/book for the entire proof, but here is the basic idea.
*** Key quantity
$B(N, k)$: Maximum number of dichotomies on N points, with a break
point k. 
*Note*: This does not depend on the hypothesis set or input
space, it is purely combinatorial.

Given, N points and a break point k, can we come up with a polynomial
bound for $m_H(N, k)$.
*** Recursive bound
The proof is based on a recursive argument. (see lectures for details)

Divide all possible dichotomies, into 2 types, \alpha and 2.\beta.

\alpha:

Dichotomies that differ in N-1 points, (excluding the last point)

2.\beta
Dichotomies that differ in the N^{th} point.
i.e all {x_1, x_2 ... x_{N-1}} come twice, once with Nth point as +1 and once with Nth point as -1.

$$B(N, k) \le \alpha + 2.\beta$$

Consider \alpha + \beta. Every element in this set is different.  If we can find all possible
patterns on any k columns here, that means we can find all possible
patterns on $B(N, k)$ (which is not possible)

$$ \alpha + \beta \le B(N-1, k) $$ 

Consider \beta,

$$ \beta \le B(N-1, k-1) $$ 

If we had all possible patterns for any k-1 guys in the N-1 points,
that means we have all possible patterns for k guys on N points. (by
construction) This is not true because of our definition of B(N, k).

$$B(N, k) \le B(N-1, k) + B(N-1, k-1)$$

Solving for this, we get

$$B(N, k) \le \Sigma^{k-1}_{0} {N \choose i}$$
*** B(N, k) is a polynomial!
For a given H, the break point k is fixed.

m_H(N) \le B(N, k)

B(N, k) is polynomial in N. The maximum power in B(N, k) is N^{k-1}, hence its a polynomial.
*** How can m_H(N) replace M
This is a slightly involved proof, given in the text book.

See slides for a pictorial proof. Here is the basic idea...
3 points
1. How does m_H(N) relate to overlaps?
2. What to do about E_out
3. Putting it together

1. The basic idea is that, a dichotomy captures overlaps. Since a
   dichotomy changes only when any one of the points in our sample is
   classified differently, it captures the overlap between all
   hypothesis that classify all points in the input space the same
   way!
2. This is what Vapnik-Chervonenki did,
For a given hypothesis h, we compute E_{in}(h) and E_{out}(h).
How do we get rid of E_{out}?
Pick another sample E_{in'}(h)

Does E_{in}(h) track E_{in'}(h)? Well yes, a little more loosely, but
yes. The advantage is that, doing so allows us to stay within the
realm of dichotomies.

3. Putting this stuff together, we get the v.c inequality.
*** The Vapnik-Chervonenkis Inequality

$$ P[|E_{in}(g) - E_{out}(g) | \gt \epsilon] \le 4.m_{H}(2N).e^{-\frac{1}{8}.\epsilon^{2}.N} $$
* 7 - The VC-Dimension
Most useful quantity from all of the theory we discussed. Something to
remember throughout your career ;)
** What is this?
The VC-dimension is defined for a hypothesis set /H/, denoted by d_{VC}(H)

/It's the maximum number of points that can be shattered by a given hypothesis
set./ Formally, its the largest value of N for which $m_H(N) = 2^{N}$.

$N \le d_VC(H) \Rightarrow H can shatter N points$ 
$k \ge d_VC(H) => k is a break point for H$

In terms of a breakpoint k, the growth function
$$ m_{H}(N) \le \Sigma^{k - 1}_{i = 0}{N \choose i} $$

In terms of vc-dimension,
$$ m_{H}(N) \le \Sigma^{d_{VC}(H)}_{i = 0}{N \choose i} $$
** VC-dimension and learning
$d_{VC} is finite$ => g \in H will generalize$

(refer to the learning diagram)
- independent of the learning algorithm
- independent of the input distribution
- independent of the target function
** VC-dimension of the perceptron
$d_{VC} = d+1 for a 'd' dimensional space$ (refer to slides for proof)
** Interpretting the vc dimension (using the perceptron example)
