dist/learning-from-data.html

<div id="outline-container-org497b4d8" class="outline-4">
<h4 id="org497b4d8"><span class="section-number-4">5.3.1</span> Why do we care about this?</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
That's because if P[1 &gt; &epsilon;], P[2 &gt; &epsilon;] is also pretty
high.
</p>
</div>
</div>
<div id="outline-container-orgaef3632" class="outline-4">
<h4 id="orgaef3632"><span class="section-number-4">5.3.2</span> Dichotomies (mini-hypothesis)</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
A hypothesis \(h: X -> {+1, -1}\).
A dichotomy \(h: x_{1}, x_{2} ... x_{N} -> {+1, -1}\)
</p>

<p>
Thus, a dichotomy is defined only on points in the input space.
</p>

<p>
Number of hypothesis |H| can be infinite, but number of dichotomies can be atmost 2<sup>N</sup>.
</p>

<p>
Dichotomy is a candidate for replacing <i>M</i>.
</p>
</div>
</div>

<div id="outline-container-org951c59c" class="outline-4">
<h4 id="org951c59c"><span class="section-number-4">5.3.3</span> Growth Funciton</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
Growth function \(m_H(N)\) is defined as the most number of dichotomies on any 'N' points.
</p>

<p>
What does that mean? Pick any set of 'N' points from the input space,
such that maximum number of dichotomies can be realized.
</p>

<p>
\[ m_H(N) = max_{x_{1}, x_{2} ... x_{N}}|H(x_{1} ... x_{N}|. \]
</p>

<p>
Also \(m_H(N) \le 2^N\)
</p>

<p>
For example, lets take the perceptron model in 2-D space.
</p>

<ul class="org-ul">
<li>Given N = 3, we can arrange 3 points in a way such that all possible
2<sup>3</sup> = 8 dichotomies can be realized.</li>
</ul>

<p>
Thus, \(m_H(3) = 2^3\) (Maximum possible dichotomies)
</p>

<ul class="org-ul">
<li>Given N = 4, no matter how we arrange 4 points, we cannot get all
possible dichotomies of 2<sup>4</sup> = 16. We'll get something less than
2<sup>4</sup>. (Actual value is 14)</li>
</ul>
</div>
</div>
<div id="outline-container-orgef7e269" class="outline-4">
<h4 id="orgef7e269"><span class="section-number-4">5.3.4</span> key terms: Shattering and Breakpoint</h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
We call 'N' points as being <i>shattered</i> by a hypothesis set, if we can
realize all possible 2<sup>N</sup> possibilities.
</p>

<p>
Definition: If no dataset of size 'k' can be <i>shattered</i> by a
hypothesis set <i>H</i>, then k is a <i>breakpoint</i> for <i>H</i>.
</p>

<p>
Ex) The breakpoint for 2-D perceptron is 4. \(m_H(k) \lt 2^{m}\)
</p>

<p>
No break point =&gt; \(m_H(N) = 2^{N}\)
</p>

<p>
Any break point =&gt; \(m_H(N) \lt 2^{N}\)
</p>
</div>
</div>
<div id="outline-container-orgddfea2c" class="outline-4">
<h4 id="orgddfea2c"><span class="section-number-4">5.3.5</span> What can we do with this stuff?</h4>
<div class="outline-text-4" id="text-5-3-5">
<p>
We had,
</p>

<p>
\[ P[ |E_{in} - E_{out}| \gt \epsilon ]  \le 2.M.e^{-2.\epsilon^{2}.N} \]
</p>

<p>
Here is what we can try to do, if we can replace <i>M</i> with m<sub>H</sub>(N) and
prove that m<sub>H</sub>(N) is polynomial, then we can get a finite bound on
P[B<sub>1</sub> or B<sub>2</sub> &#x2026; B<sub>N</sub>], that is finite even for an infinite hypothesis
sets.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcccd5a7" class="outline-2">
<h2 id="orgcccd5a7"><span class="section-number-2">6</span> 6 - Theory of generalization</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org430effa" class="outline-3">
<h3 id="org430effa"><span class="section-number-3">6.1</span> 2 things to prove</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Prove that \(m_H(N)\) is polynomial.</li>
<li>Proof that \(m_H(N)\) can replace M.</li>
</ul>
</div>
</div>
<div id="outline-container-org376f65d" class="outline-3">
<h3 id="org376f65d"><span class="section-number-3">6.2</span> Bounding \(m_H(N)\)</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The goal is to show \(m_H(N)\) &le; a polynomial.
</p>

<p>
Checkout lectures/book for the entire proof, but here is the basic idea.
</p>
</div>
<div id="outline-container-org7d65c3d" class="outline-4">
<h4 id="org7d65c3d"><span class="section-number-4">6.2.1</span> Key quantity</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
\(B(N, k)\): Maximum number of dichotomies on N points, with a break
point k. 
<b>Note</b>: This does not depend on the hypothesis set or input
space, it is purely combinatorial.
</p>

<p>
Given, N points and a break point k, can we come up with a polynomial
bound for \(m_H(N, k)\).
</p>
</div>
</div>
<div id="outline-container-orga1b703c" class="outline-4">
<h4 id="orga1b703c"><span class="section-number-4">6.2.2</span> Recursive bound</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
The proof is based on a recursive argument. (see lectures for details)
</p>

<p>
Divide all possible dichotomies, into 2 types, &alpha; and 2.&beta;.
</p>

<p>
&alpha;:
</p>

<p>
Dichotomies that differ in N-1 points, (excluding the last point)
</p>

<p>
2.&beta;
Dichotomies that differ in the N<sup>th</sup> point.
i.e all {x<sub>1</sub>, x<sub>2</sub> &#x2026; x<sub>N-1</sub>} come twice, once with Nth point as +1 and once with Nth point as -1.
</p>

<p>
\[B(N, k) \le \alpha + 2.\beta\]
</p>

<p>
Consider &alpha; + &beta;. Every element in this set is different.  If we can find all possible
patterns on any k columns here, that means we can find all possible
patterns on \(B(N, k)\) (which is not possible)
</p>

<p>
\[ \alpha + \beta \le B(N-1, k) \] 
</p>

<p>
Consider &beta;,
</p>

<p>
\[ \beta \le B(N-1, k-1) \] 
</p>

<p>
If we had all possible patterns for any k-1 guys in the N-1 points,
that means we have all possible patterns for k guys on N points. (by
construction) This is not true because of our definition of B(N, k).
</p>

<p>
\[B(N, k) \le B(N-1, k) + B(N-1, k-1)\]
</p>

<p>
Solving for this, we get
</p>

<p>
\[B(N, k) \le \Sigma^{k-1}_{0} {N \choose i}\]
</p>
</div>
</div>
<div id="outline-container-org5d25a35" class="outline-4">
<h4 id="org5d25a35"><span class="section-number-4">6.2.3</span> B(N, k) is a polynomial!</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
For a given H, the break point k is fixed.
</p>

<p>
m<sub>H</sub>(N) &le; B(N, k)
</p>

<p>
B(N, k) is polynomial in N. The maximum power in B(N, k) is N<sup>k-1</sup>, hence its a polynomial.
</p>
</div>
</div>
<div id="outline-container-org9705cf8" class="outline-4">
<h4 id="org9705cf8"><span class="section-number-4">6.2.4</span> How can m<sub>H</sub>(N) replace M</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
This is a slightly involved proof, given in the text book.
</p>

<p>
See slides for a pictorial proof. Here is the basic idea&#x2026;
3 points
</p>
<ol class="org-ol">
<li>How does m<sub>H</sub>(N) relate to overlaps?</li>
<li>What to do about E<sub>out</sub></li>
<li>Putting it together</li>

<li>The basic idea is that, a dichotomy captures overlaps. Since a
dichotomy changes only when any one of the points in our sample is
classified differently, it captures the overlap between all
hypothesis that classify all points in the input space the same
way!</li>
<li>This is what Vapnik-Chervonenki did,</li>
</ol>
<p>
For a given hypothesis h, we compute E<sub>in</sub>(h) and E<sub>out</sub>(h).
How do we get rid of E<sub>out</sub>?
Pick another sample E<sub>in'</sub>(h)
</p>

<p>
Does E<sub>in</sub>(h) track E<sub>in'</sub>(h)? Well yes, a little more loosely, but
yes. The advantage is that, doing so allows us to stay within the
realm of dichotomies.
</p>

<ol class="org-ol">
<li>Putting this stuff together, we get the v.c inequality.</li>
</ol>
</div>
</div>
<div id="outline-container-org3db4400" class="outline-4">
<h4 id="org3db4400"><span class="section-number-4">6.2.5</span> The Vapnik-Chervonenkis Inequality</h4>
<div class="outline-text-4" id="text-6-2-5">
<p>
\[ P[|E_{in}(g) - E_{out}(g) | \gt \epsilon] \le 4.m_{H}(2N).e^{-\frac{1}{8}.\epsilon^{2}.N} \]
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org5ddac84" class="outline-2">
<h2 id="org5ddac84"><span class="section-number-2">7</span> 7 - The VC-Dimension</h2>
<div class="outline-text-2" id="text-7">
<p>
Most useful quantity from all of the theory we discussed. Something to
remember throughout your career ;)
</p>
</div>
<div id="outline-container-org0de3ccc" class="outline-3">
<h3 id="org0de3ccc"><span class="section-number-3">7.1</span> What is this?</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The VC-dimension is defined for a hypothesis set <i>H</i>, denoted by d<sub>VC</sub>(H)
</p>

<p>
<i>It's the maximum number of points that can be shattered by a given hypothesis
set.</i> Formally, its the largest value of N for which \(m_H(N) = 2^{N}\).
</p>

<p>
\(N \le d_VC(H) \Rightarrow H can shatter N points\) 
\(k \ge d_VC(H) => k is a break point for H\)
</p>

<p>
In terms of a breakpoint k, the growth function
\[ m_{H}(N) \le \Sigma^{k - 1}_{i = 0}{N \choose i} \]
</p>

<p>
In terms of vc-dimension,
\[ m_{H}(N) \le \Sigma^{d_{VC}(H)}_{i = 0}{N \choose i} \]
</p>
</div>
</div>
<div id="outline-container-orgab33219" class="outline-3">
<h3 id="orgab33219"><span class="section-number-3">7.2</span> VC-dimension and learning</h3>
<div class="outline-text-3" id="text-7-2">
<p>
\(d_{VC} is finite\) =&gt; g &isin; H will generalize$
</p>

<p>
(refer to the learning diagram)
</p>
<ul class="org-ul">
<li>independent of the learning algorithm</li>
<li>independent of the input distribution</li>
<li>independent of the target function</li>
</ul>
</div>
</div>
<div id="outline-container-org4abfd6a" class="outline-3">
<h3 id="org4abfd6a"><span class="section-number-3">7.3</span> VC-dimension of the perceptron</h3>
<div class="outline-text-3" id="text-7-3">
<p>
\(d_{VC} = d+1 for a 'd' dimensional space\) (refer to slides for proof)
</p>
</div>
</div>
<div id="outline-container-orgaaace58" class="outline-3">
<h3 id="orgaaace58"><span class="section-number-3">7.4</span> Interpretting the vc dimension (using the perceptron example)</h3>
<div class="outline-text-3" id="text-7-4">
</div>
