learning-from-data.org
*** Degrees of freedom
Parameters of a model give us degrees of freedom in order to create multiple hypothesis. i.e we can vary
these parameters, to get new outputs from the model.

Number of parameters $\Rightarrow$ analog degrees of freedom

d_VC{H} equivalent 'binary' degrees of freedom.

d_{VC} tells us how 'expressive' a model is. Inside a model (like
perceptron or neural networks), there can be multiple parameters
(analog df) that vary and but the output does not change. We care only
about the variation seen in the output. Thus, if I have a model that
has a d_{VC} of 20, and someone else has a model of d_{VC} of 30, it means
they have more degrees of freedom.

For the perceptron hypothesis set, we noticed that the vc-dimension is 'd+1'.
What does this mean?

Well, the number of parameters in the perceptron model is d+1 (namely
w_{0}, w_{1}, ... w_{d}). In this case, we have v_{DC} = number of parameters.

If we have a model that has redundant parameters, the v_{DC} will be
smaller than the number of parameters. (See slides for example)
vc-dimension is a quantity that gives us the /effective/ degrees of
freedom.
*** Number of data points needed
How does value of v_{DC} affect the number of examples needed?

The VC Inequality,

$$ P[|E_{in} - E_{out}| > \epsilon] \le \underbrace{4.m_{H}(2N).e^{-\frac{1}{8}.\epsilon^{2}.N}}_{\delta} $$

If we want certain \epsilon and \delta, how does N depend on d_{VC}?

Lets look at N^{d}.e^{-N}. (See slides for details) This curve starts
with the powerful polynomial but is eventually killed by the negative
exponential.

Looking the curves,

$$ N \propto v_{DC} $$

/A practical observation here is that the actual quantity that we are
trying to bound, follows the same monotonicity as the bound./
i.e, bigger d_{VC}, the more the examples we need.

This initially didn't make too much sense to me, but the professor
explains it very nicely with an example.

Consider 2 people A, B who have 2 models, with 2 vc dimensions, and
each measure their performance.  A's performance is bounded by a_1,
and B's performance is bounded by b_2 where $a_1 > b_2$. These are the
bounds. The actual performance, of A, B need not follow the same
monotonicity as the bounds. i.e the performance p_A can be < p_B.  The
practical observation says this is not the case. The performance also
follows the same monotonicity.

Rule of thumb for getting 'reasonable' generalization:

$$ N \ge 10.v_{DC} $$
** Rearranging things
The VC Inequality,

$$ P[|E_{in} - E_{out}| > \epsilon] \le \underbrace{4.m_{H}(2N).e^{-\frac{1}{8}.\epsilon^{2}.N}}_{\delta} $$

Getting \epsilon in terms of \delta:
Given a reliability of \delta, what tolerance \epsilon can we guarentee?

$$ \delta = 4m_H(2N).e^{-\frac{1}{8}\epsilon^2} $$
$$ \epsilon = \underbrace{
\sqrt{\frac{8}{N}\ln\frac{4m_{H}(2N)}{\delta}}
}_{\Omega} $$

Bigger the vc dimension, worse the guarantee on generalization. More
the number of examples, better the \Omega.

Thus, with probability > 1 - \delta, $|E_{in} - E_{out}| \le \Omega(N, H, \delta)

Generalization bound,
With probability \ge 1 - \delta,

E_{out} - E_{in} \le \Omega (Invariably, E_{in} is smaller than E_{out})

This quantity is known as the /generalization error/.

Rearranging, we have
With probability \ge 1 - \delta,

$$ E_{out} \le \Omega + \E_{in} $$

Interesting, we can see that E_{out} is bounded by 2 quantities we
know. E_{in} and \Omega. 

Furthermore, E_{in} can be minimized with a 'bigger' hypothesis set,
but \Omega goes up! So its a tradeoff!! We'll derive regularization
based on this quantity.
* 8 - Bias-Variance Tradeoff
Stand-alone theory. Different angle on generalization.
** Approximation-generalization tradeoff

Small E_{out}: good approximation of f.

More complex H \Rightarrow better chance of approximating f.

Less complex H \Rightarrow better chance of generalizing out of sample.
** Quantifying this trade-off

One approach was the vc-analysis,

$$ E_{out} \le E_{in} + \Omega $$

Bias-variance analyis is another way of decomposing E_{out} into

1) How well H can approximate f. (This is overall! Not in-sample approximation as done in vc analysis)
2) How well can we zoom in on a good h \in H

Our analysis applies to real-valued targets and uses squared error.
** Start with E_{out}
See slides for the full derivation, but here is the basic idea.

$$ E_{out}(g^{(D)}) = E_{x}[ (g^{(D)}(x) - f(x))^2 ] $$

We'd like to get rid of the dependency on the dataset D,

$$ E_D[E_{out}(g^{(D)}] = E_{D}[E_{x}[ (g^{(D)}(x) - f(x))^2 ]] $$

switch the order of E's

$E_{x}[\underbrace{E_{D}[(g^{(D)}(x) - f(x))^2]}_{inner-expectation}]$

Now, let's focus on the inner-expectation.

The averate hypothesis,

To evaluate the inner-expectation, 

we define an 'average' hypothesis

$$ \bar{g}(x) = E_{D}[g^{D}(x)] $$

Imagine you have many data sets D_{1}, D_{2} ... D_{k}, $\bar{g}(x)$ is
just the average hypothesis we get considering all of these datasets.

add and subract $\bar{g}(x)$ to inner-expectation, group and simplify, (see slides for details)

E_{D}[((g^{(D)}(x) - \bar{g}(x)) + (\bar{g}(x) - f(x)))^2]

we get, 

$$ E_{D}[(g^{D}(x) - \bar{g}(x))^{2}] + (\bar{g}(x) - f(x))^2 $$
** Bias and Variance

$$ \underbrace{E_{D}[(g^{D}(x) - \bar{g}(x))^{2}]}_{var(x)} + \underbrace{(\bar{g}(x) - f(x))^2}_{bias(x)} $$

Intuitive idea, 

Bias: How far is the 'average' hypothesis of the set (which is the
best hypothesis), from the target function.

Variance: How far is the actual hypothesis we found, from this average hypothesis.

Therefore,

E_D[E_out(g^{D})] = E_{x}[bias(x) + var(x)]
		  = bias + var

What's the tradeoff?

Well, if we have a very complicated hypothesis set, the variance is high. (hard to find the correct hypothesis)
If we have a small hypothesis set, bias is high. (it may not have the actual target function)

There is a very nice example in the slides for understanding bias and variance. (the sinusoid example!)
** Lesson learned
Match 'model complexity' to the data resources you have, not to the *target complexity*.
** Learning curves (expected E_{out} and E_{in})
Data set D of size N
Expected out-of-sample error E_{D}[E_{out}(g^{(D)})]
Expected in-sample error E_{D}[E_{in}(g^{(D)})]

How do they vary with N?
See slides for details.
* 9 - Linear Model 2
* 10 - Neural Networks
