dist/learning-from-data.html
<div id="outline-container-orgd9df5c5" class="outline-4">
<h4 id="orgd9df5c5"><span class="section-number-4">7.4.1</span> Degrees of freedom</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
Parameters of a model give us degrees of freedom in order to create multiple hypothesis. i.e we can vary
these parameters, to get new outputs from the model.
</p>

<p>
Number of parameters \(\Rightarrow\) analog degrees of freedom
</p>

<p>
d<sub>VC</sub>{H} equivalent 'binary' degrees of freedom.
</p>

<p>
d<sub>VC</sub> tells us how 'expressive' a model is. Inside a model (like
perceptron or neural networks), there can be multiple parameters
(analog df) that vary and but the output does not change. We care only
about the variation seen in the output. Thus, if I have a model that
has a d<sub>VC</sub> of 20, and someone else has a model of d<sub>VC</sub> of 30, it means
they have more degrees of freedom.
</p>

<p>
For the perceptron hypothesis set, we noticed that the vc-dimension is 'd+1'.
What does this mean?
</p>

<p>
Well, the number of parameters in the perceptron model is d+1 (namely
w<sub>0</sub>, w<sub>1</sub>, &#x2026; w<sub>d</sub>). In this case, we have v<sub>DC</sub> = number of parameters.
</p>

<p>
If we have a model that has redundant parameters, the v<sub>DC</sub> will be
smaller than the number of parameters. (See slides for example)
vc-dimension is a quantity that gives us the <i>effective</i> degrees of
freedom.
</p>
</div>
</div>
<div id="outline-container-orge64c909" class="outline-4">
<h4 id="orge64c909"><span class="section-number-4">7.4.2</span> Number of data points needed</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
How does value of v<sub>DC</sub> affect the number of examples needed?
</p>

<p>
The VC Inequality,
</p>

<p>
\[ P[|E_{in} - E_{out}| > \epsilon] \le \underbrace{4.m_{H}(2N).e^{-\frac{1}{8}.\epsilon^{2}.N}}_{\delta} \]
</p>

<p>
If we want certain &epsilon; and &delta;, how does N depend on d<sub>VC</sub>?
</p>

<p>
Lets look at N<sup>d</sup>.e<sup>-N</sup>. (See slides for details) This curve starts
with the powerful polynomial but is eventually killed by the negative
exponential.
</p>

<p>
Looking the curves,
</p>

<p>
\[ N \propto v_{DC} \]
</p>

<p>
<i>A practical observation here is that the actual quantity that we are
trying to bound, follows the same monotonicity as the bound.</i>
i.e, bigger d<sub>VC</sub>, the more the examples we need.
</p>

<p>
This initially didn't make too much sense to me, but the professor
explains it very nicely with an example.
</p>

<p>
Consider 2 people A, B who have 2 models, with 2 vc dimensions, and
each measure their performance.  A's performance is bounded by a<sub>1</sub>,
and B's performance is bounded by b<sub>2</sub> where \(a_1 > b_2\). These are the
bounds. The actual performance, of A, B need not follow the same
monotonicity as the bounds. i.e the performance p<sub>A</sub> can be &lt; p<sub>B</sub>.  The
practical observation says this is not the case. The performance also
follows the same monotonicity.
</p>

<p>
Rule of thumb for getting 'reasonable' generalization:
</p>

<p>
\[ N \ge 10.v_{DC} \]
</p>
</div>
</div>
</div>
<div id="outline-container-org26dca03" class="outline-3">
<h3 id="org26dca03"><span class="section-number-3">7.5</span> Rearranging things</h3>
<div class="outline-text-3" id="text-7-5">
<p>
The VC Inequality,
</p>

<p>
\[ P[|E_{in} - E_{out}| > \epsilon] \le \underbrace{4.m_{H}(2N).e^{-\frac{1}{8}.\epsilon^{2}.N}}_{\delta} \]
</p>

<p>
Getting &epsilon; in terms of &delta;:
Given a reliability of &delta;, what tolerance &epsilon; can we guarentee?
</p>

<p>
\[ \delta = 4m_H(2N).e^{-\frac{1}{8}\epsilon^2} \]
\[ \epsilon = \underbrace{
\sqrt{\frac{8}{N}\ln\frac{4m_{H}(2N)}{\delta}}
}_{\Omega} \]
</p>

<p>
Bigger the vc dimension, worse the guarantee on generalization. More
the number of examples, better the &Omega;.
</p>

<p>
Thus, with probability &gt; 1 - &delta;, $|E<sub>in</sub> - E<sub>out</sub>| &le; &Omega;(N, H, &delta;)
</p>

<p>
Generalization bound,
With probability &ge; 1 - &delta;,
</p>

<p>
E<sub>out</sub> - E<sub>in</sub> &le; &Omega; (Invariably, E<sub>in</sub> is smaller than E<sub>out</sub>)
</p>

<p>
This quantity is known as the <i>generalization error</i>.
</p>

<p>
Rearranging, we have
With probability &ge; 1 - &delta;,
</p>

<p>
\[ E_{out} \le \Omega + \E_{in} \]
</p>

<p>
Interesting, we can see that E<sub>out</sub> is bounded by 2 quantities we
know. E<sub>in</sub> and &Omega;. 
</p>

<p>
Furthermore, E<sub>in</sub> can be minimized with a 'bigger' hypothesis set,
but &Omega; goes up! So its a tradeoff!! We'll derive regularization
based on this quantity.
</p>
</div>
</div>
</div>
<div id="outline-container-org6c17af3" class="outline-2">
<h2 id="org6c17af3"><span class="section-number-2">8</span> 8 - Bias-Variance Tradeoff</h2>
<div class="outline-text-2" id="text-8">
<p>
Stand-alone theory. Different angle on generalization.
</p>
</div>
<div id="outline-container-org2974daa" class="outline-3">
<h3 id="org2974daa"><span class="section-number-3">8.1</span> Approximation-generalization tradeoff</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Small E<sub>out</sub>: good approximation of f.
</p>

<p>
More complex H &rArr; better chance of approximating f.
</p>

<p>
Less complex H &rArr; better chance of generalizing out of sample.
</p>
</div>
</div>
<div id="outline-container-org7e1b25c" class="outline-3">
<h3 id="org7e1b25c"><span class="section-number-3">8.2</span> Quantifying this trade-off</h3>
<div class="outline-text-3" id="text-8-2">
<p>
One approach was the vc-analysis,
</p>

<p>
\[ E_{out} \le E_{in} + \Omega \]
</p>

<p>
Bias-variance analyis is another way of decomposing E<sub>out</sub> into
</p>

<ol class="org-ol">
<li>How well H can approximate f. (This is overall! Not in-sample approximation as done in vc analysis)</li>
<li>How well can we zoom in on a good h &isin; H</li>
</ol>

<p>
Our analysis applies to real-valued targets and uses squared error.
</p>
</div>
</div>
<div id="outline-container-org41ad5ee" class="outline-3">
<h3 id="org41ad5ee"><span class="section-number-3">8.3</span> Start with E<sub>out</sub></h3>
<div class="outline-text-3" id="text-8-3">
<p>
See slides for the full derivation, but here is the basic idea.
</p>

<p>
\[ E_{out}(g^{(D)}) = E_{x}[ (g^{(D)}(x) - f(x))^2 ] \]
</p>

<p>
We'd like to get rid of the dependency on the dataset D,
</p>

<p>
\[ E_D[E_{out}(g^{(D)}] = E_{D}[E_{x}[ (g^{(D)}(x) - f(x))^2 ]] \]
</p>

<p>
switch the order of E's
</p>

<p>
\(E_{x}[\underbrace{E_{D}[(g^{(D)}(x) - f(x))^2]}_{inner-expectation}]\)
</p>

<p>
Now, let's focus on the inner-expectation.
</p>

<p>
The averate hypothesis,
</p>

<p>
To evaluate the inner-expectation, 
</p>

<p>
we define an 'average' hypothesis
</p>

<p>
\[ \bar{g}(x) = E_{D}[g^{D}(x)] \]
</p>

<p>
Imagine you have many data sets D<sub>1</sub>, D<sub>2</sub> &#x2026; D<sub>k</sub>, \(\bar{g}(x)\) is
just the average hypothesis we get considering all of these datasets.
</p>

<p>
add and subract \(\bar{g}(x)\) to inner-expectation, group and simplify, (see slides for details)
</p>

<p>
E<sub>D</sub>[((g<sup>(D)</sup>(x) - \bar{g}(x)) + (\bar{g}(x) - f(x)))<sup>2</sup>]
</p>

<p>
we get, 
</p>

<p>
\[ E_{D}[(g^{D}(x) - \bar{g}(x))^{2}] + (\bar{g}(x) - f(x))^2 \]
</p>
</div>
</div>
<div id="outline-container-orgb574553" class="outline-3">
<h3 id="orgb574553"><span class="section-number-3">8.4</span> Bias and Variance</h3>
<div class="outline-text-3" id="text-8-4">
<p>
\[ \underbrace{E_{D}[(g^{D}(x) - \bar{g}(x))^{2}]}_{var(x)} + \underbrace{(\bar{g}(x) - f(x))^2}_{bias(x)} \]
</p>

<p>
Intuitive idea, 
</p>

<p>
Bias: How far is the 'average' hypothesis of the set (which is the
best hypothesis), from the target function.
</p>

<p>
Variance: How far is the actual hypothesis we found, from this average hypothesis.
</p>

<p>
Therefore,
</p>

<p>
E<sub>D</sub>[E<sub>out</sub>(g<sup>D</sup>)] = E<sub>x</sub>[bias(x) + var(x)]
		  = bias + var
</p>

<p>
What's the tradeoff?
</p>

<p>
Well, if we have a very complicated hypothesis set, the variance is high. (hard to find the correct hypothesis)
If we have a small hypothesis set, bias is high. (it may not have the actual target function)
</p>

<p>
There is a very nice example in the slides for understanding bias and variance. (the sinusoid example!)
</p>
</div>
</div>
<div id="outline-container-org44cac8d" class="outline-3">
<h3 id="org44cac8d"><span class="section-number-3">8.5</span> Lesson learned</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Match 'model complexity' to the data resources you have, not to the <b>target complexity</b>.
</p>
</div>
</div>
<div id="outline-container-org70847c5" class="outline-3">
<h3 id="org70847c5"><span class="section-number-3">8.6</span> Learning curves (expected E<sub>out</sub> and E<sub>in</sub>)</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Data set D of size N
Expected out-of-sample error E<sub>D</sub>[E<sub>out</sub>(g<sup>(D)</sup>)]
Expected in-sample error E<sub>D</sub>[E<sub>in</sub>(g<sup>(D)</sup>)]
</p>

<p>
How do they vary with N?
See slides for details.
</p>
</div>
</div>
</div>
<div id="outline-container-org0adde94" class="outline-2">
<h2 id="org0adde94"><span class="section-number-2">9</span> 9 - Linear Model 2</h2>
</div>
<div id="outline-container-org672305a" class="outline-2">
<h2 id="org672305a"><span class="section-number-2">10</span> 10 - Neural Networks</h2>
<div class="outline-text-2" id="text-10">
</div>
